# Pandas tutorial

In [1]:
import pandas as pd

In [2]:
# creating and deleting rows and columns in dataframes
A = [1, 2, 3, 4]
B = [5, 6, 7, 8]
C = [9, 0, 1, 2]
D = [3, 4, 5, 6]
E = [7, 8, 9, 0]
df = pd.DataFrame([A,B,C,D,E],['a','b','c','d','e'],['w','x','y','z'])

In [3]:
df

   w  x  y  z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6
e  7  8  9  0

In [4]:
df['p']=df['y']+df['z']

In [5]:
df

   w  x  y  z   p
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11
e  7  8  9  0   9

## Deleting row(index) in dataframe

In [6]:
# row: axis=0
# column: axis=1
# temporary
df.drop('e')

   w  x  y  z   p
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11

In [7]:
# we use inplace argument as True to delete any row or column permanently
df.drop('e', inplace = True)

In [8]:
df

   w  x  y  z   p
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11

In [9]:
df.drop('p', axis=1, inplace = True)

In [10]:
df

   w  x  y  z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6

## Accessing elements in a dataframe

In [11]:
# to access column:
df['y']

a    3
b    7
c    1
d    5
Name: y, dtype: int64

In [12]:
# to access row:
df.loc['a']

w    1
x    2
y    3
z    4
Name: a, dtype: int64

In [13]:
# accessing row using numeric index
df.iloc[1]

w    5
x    6
y    7
z    8
Name: b, dtype: int64

In [14]:
df.loc['d','y']

5

In [15]:
df.iloc[1,2]

7

## Conditional accessing

In [16]:

df[df['w']>3]

   w  x  y  z
b  5  6  7  8
c  9  0  1  2

In [17]:
df['w']>3

a    False
b     True
c     True
d    False
Name: w, dtype: bool

In [18]:
df>3

       w      x      y      z
a  False  False  False   True
b   True   True   True   True
c   True  False  False  False
d  False   True   True   True

In [19]:
df[df>3]

     w    x    y    z
a  NaN  NaN  NaN  4.0
b  5.0  6.0  7.0  8.0
c  9.0  NaN  NaN  NaN
d  NaN  4.0  5.0  6.0

In [20]:
df

   w  x  y  z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6

In [21]:
df[(df['w']>3) & (df['z']>8)]

Empty DataFrame
Columns: [w, x, y, z]
Index: []

In [22]:
df[(df['w']>3) | (df['z']>8)]

   w  x  y  z
b  5  6  7  8
c  9  0  1  2

In [23]:
df[(df['w']>3) & (df['z']>2)]

   w  x  y  z
b  5  6  7  8

In [24]:
df[df['w']>3][['w','x','y','z']]

   w  x  y  z
b  5  6  7  8
c  9  0  1  2

## Analysing data using groupby

In [2]:
p = {'items':['apples','apples','orange','orange','guns','guns','guns'],
     'days':['mon','tue','wed','thurs','fri','sat','sun'],
     'sales':[100,80,200,150,5,10,5]}

In [8]:
print(type(p))

<class 'dict'>

{'items': ['apples', 'apples', 'orange', 'orange', 'guns', 'guns', 'guns'],
 'days': ['mon', 'tue', 'wed', 'thurs', 'fri', 'sat', 'sun'],
 'sales': [100, 80, 200, 150, 5, 10, 5]}

In [27]:
new_df = pd.DataFrame(p)

In [28]:
new_df

    items   days  sales
0  apples    mon    100
1  apples    tue     80
2  orange    wed    200
3  orange  thurs    150
4    guns    fri      5
5    guns    sat     10
6    guns    sun      5

In [29]:
x = new_df.groupby('items')

In [30]:
x
# returns groupby object that contains information about the groups

In [31]:
x.mean()

             sales
items
apples   90.000000
guns      6.666667
orange  175.000000

In [32]:
x.sum()

        sales
items
apples    180
guns       20
orange    350

In [33]:
x.std()

            sales
items
apples  14.142136
guns     2.886751
orange  35.355339

In [34]:
x.count()

        days  sales
items
apples     2      2
guns       3      3
orange     2      2

In [35]:
x.describe().transpose()

items            apples       guns      orange
sales count    2.000000   3.000000    2.000000
      mean    90.000000   6.666667  175.000000
      std     14.142136   2.886751   35.355339
      min     80.000000   5.000000  150.000000
      25%     85.000000   5.000000  162.500000
      50%     90.000000   5.000000  175.000000
      75%     95.000000   7.500000  187.500000
      max    100.000000  10.000000  200.000000

## Joining

In [9]:
a1 = {'a':[1,2,3], 'b':[4,5,6]}
b1 = {'c':[7,8,9], 'd':[1,3,5]}

In [10]:
df1 = pd.DataFrame(a1, index = ['p1','p2','p3'])
df2 = pd.DataFrame(b1, index = ['p4','p5','p6'])

In [11]:
df1

    a  b
p1  1  4
p2  2  5
p3  3  6

In [12]:
df2

    c  d
p4  7  1
p5  8  3
p6  9  5

In [13]:
# default value of how is left
df1.join(df2,how = 'outer')

      a    b    c    d
p1  1.0  4.0  NaN  NaN
p2  2.0  5.0  NaN  NaN
p3  3.0  6.0  NaN  NaN
p4  NaN  NaN  7.0  1.0
p5  NaN  NaN  8.0  3.0
p6  NaN  NaN  9.0  5.0

In [14]:
df1.join(df2,how = 'left')

    a  b   c   d
p1  1  4 NaN NaN
p2  2  5 NaN NaN
p3  3  6 NaN NaN

In [42]:
df1.join(df2,how = 'inner')

Empty DataFrame
Columns: [a, b, c, d]
Index: []

## Concatenation

In [43]:
d1 = {'a':[1,1,1,1,1],'b':[1,1,1,1,1],'c':[1,1,1,1,1],'d':[1,1,1,1,1]}
d2 = {'d':[2,2,2,2,2],'f':[2,2,2,2,2],'g':[2,2,2,2,2],'h':[2,2,2,2,2]}
d3 = {'a':[3,3,3,3,3],'b':[3,3,3,3,3],'c':[3,3,3,3,3],'d':[3,3,3,3,3]}

In [44]:
df01 = pd.DataFrame(d1,index = [1,2,3,4,5])
df02 = pd.DataFrame(d2,index = [5,6,7,8,9])
df03 = pd.DataFrame(d3,index = [1,2,3,4,5])

In [45]:
pd.concat([df01,df02],axis = 0)

     a    b    c  d    f    g    h
1  1.0  1.0  1.0  1  NaN  NaN  NaN
2  1.0  1.0  1.0  1  NaN  NaN  NaN
3  1.0  1.0  1.0  1  NaN  NaN  NaN
4  1.0  1.0  1.0  1  NaN  NaN  NaN
5  1.0  1.0  1.0  1  NaN  NaN  NaN
5  NaN  NaN  NaN  2  2.0  2.0  2.0
6  NaN  NaN  NaN  2  2.0  2.0  2.0
7  NaN  NaN  NaN  2  2.0  2.0  2.0
8  NaN  NaN  NaN  2  2.0  2.0  2.0
9  NaN  NaN  NaN  2  2.0  2.0  2.0

In [46]:
pd.concat([df01,df03],axis = 1)

   a  b  c  d  a  b  c  d
1  1  1  1  1  3  3  3  3
2  1  1  1  1  3  3  3  3
3  1  1  1  1  3  3  3  3
4  1  1  1  1  3  3  3  3
5  1  1  1  1  3  3  3  3

## Merging

In [47]:
data1 = pd.DataFrame({'key1':[1,2,3],'a':[4,5,6],'b':[7,8,9],'key2':[5,3,2]})
data2 = pd.DataFrame({'c':[9,8,7],'d':[6,5,4],'key2':[5,3,2],'key1':[1,2,3]})

In [48]:
pd.merge(data1,data2, how = 'outer')

   key1  a  b  key2  c  d
0     1  4  7     5  9  6
1     2  5  8     3  8  5
2     3  6  9     2  7  4

In [49]:
pd.merge(data1,data2, how = 'outer',on = 'key1')

   key1  a  b  key2_x  c  d  key2_y
0     1  4  7       5  9  6       5
1     2  5  8       3  8  5       3
2     3  6  9       2  7  4       2

In [50]:
pd.merge(data1,data2, how = 'outer',on = ['key1','key2'])

   key1  a  b  key2  c  d
0     1  4  7     5  9  6
1     2  5  8     3  8  5
2     3  6  9     2  7  4

## More operations on Pandas

In [ ]:
'''
index
columns

apply(fun)
sum()
sort_values(by=)

unique() - unique values
nunique() - no. of unique values
value_counts() - frquency of value
isnull()
'''

In [16]:
new_data = pd.DataFrame({'a':[1,2,3,4,5],'b':[10,20,30,20,50]})

In [17]:
new_data

   a   b
0  1  10
1  2  20
2  3  30
3  4  20
4  5  50

In [18]:
new_data.index

RangeIndex(start=0, stop=5, step=1)

In [19]:
new_data.columns

Index(['a', 'b'], dtype='object')

In [20]:
new_data['b'].sum()

130

In [21]:
def inc(x):
    x = x + 1
    return x

In [22]:
new_data['b'].apply(inc)

0    11
1    21
2    31
3    21
4    51
Name: b, dtype: int64

In [23]:
new_data.sort_values(['b'])

   a   b
0  1  10
1  2  20
3  4  20
2  3  30
4  5  50

In [24]:
new_data['b'].unique()

array([10, 20, 30, 50], dtype=int64)

In [25]:
new_data['b'].nunique()

4

In [26]:
new_data['b'].value_counts()

20    2
10    1
30    1
50    1
Name: b, dtype: int64

In [27]:
new_data.isnull()

       a      b
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False

In [1]:
# json - dictionary in files 
# csv - dataframes in form of files
# excel - .lxml
# html - pip install html5lib
# sql - .sqlolchemy